department_names = [
    '금마초', '낭산초', '다송초', '망성초', '미륵초', '삼기초', '석불초', '성당초', '성북초', '여산초',
    '영만초', '오산초', '오산남초', '왕궁초', '왕궁남초', '왕북초', '용남초', '용북초', '용산초', '용성초',
    '용안초', '웅포초', '이리초', '이리계문초', '이리고현초', '이리남초', '이리남창초', '이리동초', '이리동남초', '이리동북초',
    '이리동산초', '이리마한초', '이리모현초', '이리백제초', '이리부송초', '이리부천초', '이리북초', '이리북일초', 
    '이리삼성초', '이리서초', '이리석암초', '이리송학초', '이리신동초', '이리신흥초', '이리영등초', '이리중앙초', 
    '이리팔봉초', '익산초', '익산가온초', '익산궁동초', '익산어양초', '익산옥야초', '익산한벌초', '천서초', '춘포초', 
    '함라초', '함열초', '황등초', '황등남초', '흥왕초'
]